Tekla Open API Reference for Tekla Structures 2025
ReinforcementCatalog Methods
The ReinforcementCatalog type exposes the following members.
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
ReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace